[
  {
    "_id": {
      "timestamp": 1734047006,
      "counter": 15405113,
      "randomValue1": 7042435,
      "randomValue2": 26711
    },
    "title": "Farewell - Onto The Next Chapter",
    "author": {
      "name": "Physci",
      "link": "/u/Physci"
    },
    "postedTime": "13:13 PM May 31, 2023",
    "content": "When we first opened the Lunar Network, we were a team of four teenagers who wanted to create a competitive Minecraft PvP server that focused on Practice, Hardcore Factions, and PotPvP. After over four years, there has been a decrease of interest and loss of passion in those game modes from our players and ourselves.\u003Cbr\u003E\u003Cbr\u003EWith that being said, we had to make the difficult decision to close the Lunar Network for the time being. We may do something in the future with the latest versions of Minecraft, but as of June 1st, 2023, the server will be whitelisted.\u003Cbr\u003E\u003Cbr\u003EFrom the very start, our goal was to make a server that revolved around our players and community. It’s been a pleasure to interact with you all, listen to your ideas, and see you progress in the various games we once had. We believe that the majority of you are good people who just wanted to have fun on Minecraft, and so for that, we thank you for playing.\u003Cbr\u003E\u003Cbr\u003EWe had a lot of memorable moments on the Lunar Network, and we hope you all did as well. There were highs and lows, good times and bad, but all things must come to an end. \u003Cbr\u003E\u003Cbr\u003EWe will continue our work on Lunar Client to provide the best gameplay experience wherever you all choose to play next. We want to thank our incredible staff team, our talented developers, and the countless number of players who shaped the Lunar Network from the very beginning to today.\u003Cbr\u003E\u003Cbr\u003EFor now, we’re signing off. We want to thank all of our players who have continuously supported and believed in us. We appreciate you.\u003Cbr\u003E\u003Cbr\u003EWith Love,\u003Cbr\u003EMatt, Jordan, and Colin",
    "readMoreLink": "/forums/96070/farewell-onto-the-next-chapter",
    "timestamp": "1685564033"
  },
  {
    "_id": {
      "timestamp": 1734047049,
      "counter": 15906353,
      "randomValue1": 10275207,
      "randomValue2": -17516
    },
    "title": "The Start of Something New",
    "author": {
      "name": "KohiHQ Team",
      "link": "/u/KohiHQ-Team"
    },
    "postedTime": "4:55 AM Jun 1, 2025",
    "content": "This has been a long wait for everyone and we are glad to announce KohiHQ. This has been in the works for quite a while now and we want to share it with you. \u003Cbr\u003E \u003Cbr\u003E KohiHQ will have a new type of factions gamemode that will be revealed in a trailer in a few days. \u003Cbr\u003E \u003Cbr\u003E As for now we plan on having these servers up at the end of next week for testing:",
    "readMoreLink": "/forums/83683/The-Start-of-Something-New",
    "timestamp": "1748778959"
  }
]
