[
  {
    "_id": {
      "timestamp": 1734045812,
      "counter": 6076105,
      "randomValue1": 4718342,
      "randomValue2": 31273
    },
    "title": "The End",
    "author": {
      "name": "A7e3",
      "link": "/u/A7e3",
      "avatar": "https://skins.mcstats.com/face/1403a220-1552-47a3-bd9a-3c38ee4869e0"
    },
    "postedTime": "3:23 PM Dec 12, 2024",
    "content": "This is the time where we are going to be 100% honest with the community.\u003Cbr\u003E\u003Cbr\u003EWhen everything about Jonathan (itsjhalt) came out, our management team was lost. We didn't know what to say or do. Him resigning from his ownership position was true, he was not behind the scenes. However, we were under the impression that we were going to have 100% access to everything - that turned out to be false. The management team spoke with Jonathan (itsjhalt) one time after everything came out, and it was for only 1-2 hours. After that, we have not been in contact with him since. We aren’t going to get into any specifics on him due to his family’s request. We thought we could run everything without having full access to some key components of development, but it turned out we couldn’t.\u003Cbr\u003E\u003Cbr\u003EThere is absolutely no way we can continue operating MineHQ without having full ownership of the company. As of last week, development was halted as we started to come to a conclusion that the future of MineHQ was unknown. That is why there hasn’t been any major updates to games such as Bunkers, SG, Practice, and especially UHC. It’s not that we didn’t want to make the server better or weren’t listening to our players, we were. There were many good updates in progress, but we could not continue under the current circumstances. \u003Cbr\u003E\u003Cbr\u003EFor those of you who still believe CheatBreaker is not safe, we can assure you that it is. Every single rumor that claims otherwise is false. We posted an update on the CheatBreaker launcher on July 24th. For a full statement, you can read it there, or ask someone who uses CheatBreaker to screenshot it for you. CheatBreaker will continue to function for as long as it is paid for. There will be no public updates to CheatBreaker in the near future. We had a major update ready to be released to the public as a beta test, but as we said, we could not continue under the current circumstances. We are unaware of the future of CheatBreaker.\u003Cbr\u003E\u003Cbr\u003EThe only servers that will be up on MineHQ is going to be Practice and HCTeams.\u003Cbr\u003E\u003Cbr\u003EHCTeams Map 17 will continue until EOTW, we aren’t sure when that will be, but this is most likely going to be the last map, so make the best out of it. We tried bringing it back, but unfortunately that was not made possible after the events that unfolded.\u003Cbr\u003E\u003Cbr\u003EOur team plans on sticking together to give you guys a good server to play on. Whether that means joining an existing network or making one from scratch, we’re going to see what we can do. All that we ask is that you don’t hate us for making this decision. We know you guys like playing, but there is zero chance that this could have continued. There will be a post on our website regarding HCTeams.\u003Cbr\u003E\u003Cbr\u003EThanks for giving us a chance. We’re sorry.\u003Cbr\u003E\u003Cbr\u003EThis is the end of MineHQ as you know it today.",
    "readMoreLink": "/forums/83683/The-Start-of-Something-New"
  }
]
